/**
 * Copyright:   txl co.ltd
 * Author:      唐玺良
 * Description: JavaScript脚本文件，提供公用方法，供JSP网页调用
 * CodeDate:    2004-09-11
 */

//以下是错误号与提示信息的对照列表
  M01001 = "是必填项目，请输入。"
  M01002 = "填写的不是整数。"
  M01003 = "填写的不是数字，或位数不合要求。"
  M01004 = "填写的不是浮点数，或位数不合要求。"
  M01005 = "填写的不是字符串。"
  M01006 = "填写的不是有效的电子邮件格式。"
  M01007 = "填写的不是有效的身份证号码格式。"
  M01008 = "填写的不是有效的用户ID格式。"
  M01009 = "填写的字符串含有特殊字符。"
  M01010 = "填写的不是有效的日期格式yyyy-mm-dd。"
  M01011 = "『URL』错误，请正确输入。"
  M01012 = "填写的日期不是正确的创建日期。"
  M01013 = "填写的时间格式不正确。"
  M01014 = "不能有空格输入。"
  M01015 = "『邮编』请输入6位数字。"

  M01016 = "输入数字，不能用连字符。"
  M01017 = "请输入数字。"
  M01019 = "数值不正。输入正确的数值 "
  M01021 = "最大值和最小值是否正确。"
  M01022 = "请按照『○○～○○』或『○○～』的形式输入。"
  M01023 = "填写的不是有效的日期格式。"
  M01111 = "请输入数字和‘/’。"
  M01112 = "请确认年日月的输入。"
  M01113 = "为未来的年月日或不存在的年月日，请输入正确的年月日。"
  M01114 = "请输入数字和‘：’。"
  M01115 = "请输入60分以内的值。"
  M01116 = "请输入24小时以内的值。"
  M01117 =
  M01118 = "『mail』错误，请正确输入。"

  M02001 = "是必需项目，请输入。"
  M02002 = "填写的位数超过规定。"

  M10001 = "用户名称或者密码错误，输入正确的用户名称和密码。"
  M10002 = "超时，请再登录。 "

  M11004 = "有错，输入正确的开始时期和结束时期。"
  M11005 = "请按前小后大的顺序输入。"
  M11006 = "有错，输入正确的开始年月日和结束年月日 "

  M12001 = "输入内容太多，请重新输入。"
  M12002 = "输入数字太大，请重新输入。"
  M12003 = "小数点后位数太多，请重新输入。"

  M13001 = "输入数值必须在要求的范围内"
