//根据ID显示内容

//
  M01001 = "是必需项目，请输入。"
  M01002 = "填写的位数超过规定。"
  M01003 = "不能有空格输入。"
  M01006 = "输入数字，不能用连字符。"
  M01007 = "请输入数字。"
  M01009 = "数值不正。输入正确的数值 "
  M01011 = "请输入数字和'.'或者‘/’。"
  M01012 = "请确认年日月的输入。"
  M01013 = "为未来的年月日或不存在的年月日，请输入正确的年月日。"
  M01014 = "请输入数字和‘：’。"
  M01015 = "请输入60分以内的值。"
  M01016 = "请输入24小时以内的值。"
  M01017 = "『URL』错误，请正确输入。"
  M01018 = "『mail』错误，请正确输入。"
  M01020 = "『邮编』请输入3位或者6位。"
  M01021 = "最大值和最小值是否正确。"
  M01022 = "请按照『○○～○○』或『○○～』的形式输入。"

  M02001 = "是必需项目，请输入。"
  M02002 = "填写的位数超过规定。"

  M10001 = "用户名称或者密码错误，输入正确的用户名称和密码。"
  M10002 = "超时，请再登录。 "
  
  M11004 = "有错，输入正确的开始时期和结束时期。"
  M11005 = "请按前小后大的顺序输入。"                     //add
  M11006 = "有错，输入正确的开始年月日和结束年月日 "             //add

